                             艮山坤向
                                故   
                                顕             
                                考             
                                宋        
                                维                    
                                新                    
                                老                       
                                大                       
                                人   
    孝                          之               孝 
    男                          墓               女 
宋 儿   宋   儿     宋    儿             宋        宋  孝    宋        宋         宋 
明 媳   明   媳     明    媳             明  女    明  女    明   女   明  女     艳  女
辉 李   祥 卢  蔡   宣  洪    刘         会  婿    美  婿    珍   婿   莲  婿         婿    
   氏      氏  氏       氏   氏             代        张         张       周         代     
                                           兴        升        升        训         然      
                                           才        友        怀        美         强      
        孝                                                 外
        孙                                                 孙
宋 孙     宋   宋 孙   宋  宋  宋  宋     代  孙  代  孙   周  孙   张  孙   周   张   代  孙   
大 媳     大   大 媳   贵          飞     恩  媳  恩  媳       媳       媳   贞       维  媳
明 马     洋   吉 杨   幺  银  勇  龙     富  杨  举  彭   洋   杨  宇   陶   明  毅   熙  刘
   氏             氏                         氏     氏        氏       氏                氏
                                                          孙
                                                          女
        重                              宋   孙    宋    孙    宋  孙    宋  孙
        孙                              燕   女    云    女    岑  女    丹  女
宋   宋      宋                              婿          婿        婿       婿
             鑫                             周           杨       郭        杨
雄   伟      宇                              义          宇       荣
        重                                                       锋        锋
        孙
        女
   宋
   婷
