                             艮山坤向
                                故   
     孝                         祖               孝
     男                         妣               女
宋     儿                       宋    宋 女             宋  女
维     媳                       吴    维 婿             维  婿
新     颜                       氏    飞 何             秀  李
       氏                       老       泽                守
                                儒       甫                忠
                                人   
    孝                          之                外
    孙                          墓                孙
宋 孙   宋   孙     宋    孙             何  孙   何  孙   何  孙   何  孙   何  孙   何   孙
明 媳   明   媳     明    媳             靖  媳   沛  媳   沛  媳       媳       媳   沛   媳
辉 李   祥 卢  蔡   宣  洪    刘             谭   雲  李   儒  焦   逊  艾   彬  严   杰    瞿
   氏      氏  氏       氏   氏              氏      氏       氏       氏       氏         氏
                                                 外
                                                 孙
        重
        孙                              李  孙    李   孙
宋 重   宋   宋 重  宋  宋  宋  宋       华   媳    荣   媳
大 孙   大   大 孙  贵          飞           周         O
明 媳   洋   吉 媳  幺  银  勇  龙           氏
   马          杨
   氏          氏                                孙
                                                 女
        玄              玄               宋  孙    宋  孙    宋   孙   宋  孙     宋  孙
        孙              孙               明  女    明  女    明   女   明  女     艳  女
宋   宋      宋         女               会  婿    美   婿   珍   婿   莲   婿        婿
            鑫          宋                   代        张        张        周        代
雄   伟      宇         婷                   兴        升        升        训        然
                                            才        友        怀        美        强




